Saved model to disk
Loaded Model from disk
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 60)                17760     
_________________________________________________________________
dense_1 (Dense)              (None, 30)                1830      
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 248       
_________________________________________________________________
dropout_1 (Dropout)          (None, 8)                 0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 9         
=================================================================
Total params: 19,847
Trainable params: 19,847
Non-trainable params: 0
_________________________________________________________________
None
Shape test X:  (2759, 60, 13)
Shape yhat:  (2759, 1)
Shape test X (reshape):  (2759, 780)
Shape Concatenate:  (2759, 14)
Predicted Y:  [2.148286  2.1486354 2.155655  ... 4.1130238 4.121879  4.0913887]
Actual Y: 
[3. 3. 3. ... 3. 3. 3.]
Test RMSE: 3.635
TEST R square: -1.807
TEST MAE: 3.119
TEST Median AE: 3.022
