Saved model to disk
Loaded Model from disk
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 60)                17760     
_________________________________________________________________
dense_1 (Dense)              (None, 30)                1830      
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 248       
_________________________________________________________________
dropout_1 (Dropout)          (None, 8)                 0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 9         
=================================================================
Total params: 19,847
Trainable params: 19,847
Non-trainable params: 0
_________________________________________________________________
None
Shape test X:  (3469, 60, 13)
Shape yhat:  (3469, 1)
Shape test X (reshape):  (3469, 780)
Shape Concatenate:  (3469, 14)
Predicted Y:  [4.4013586 4.4931383 4.582452  ... 9.1872425 9.175809  9.119308 ]
Actual Y: 
[ 1.111111  1.111111  1.111111 ... 10.       10.       10.      ]
Test RMSE: 2.915
TEST R square: -0.216
TEST MAE: 2.481
TEST Median AE: 2.475
